#include <stdio.h>      //กรณีที่ 1

int main() {
    int score = 90.5;  // กำหนดค่าทศนิยมให้ตัวแปรชนิด int (Data Type ผิดประเภท)
    printf("Case 1: score = %d\n", score);
    return 0;
}

//กรณีที่ 1 (int) ได้ 90 เพราะเก็บได้เฉพาะเลขจำนวนเต็ม → ตัด .5 ทิ้ง

//  ทำไมต้องเลือก Data Type ให้ถูกต้อง?  = ถ้าเลือกผิด → ข้อมูลอาจ ผิดพลาด, ถูกตัดทิ้ง, หรือไม่สามารถใช้คำนวณได้ถูกต้อง

//  อธิบายและสรุปผลที่ได้จากการทดลอง = การเลือก Data Type ที่ไม่เหมาะสม จะทำให้ข้อมูลเพี้ยน ถ้าใส่เลขทศนิยมให้ตัวแปร int → ได้แค่ส่วนจำนวนเต็มเท่านั้น
