#include <stdio.h>

int main() {
    // บรรทัดที่ 1: a = 0 . 6 1 7 %
    printf("a =    0 . 6 1 7 %%\n");

    // บรรทัดที่ 2: b =       2   5     %
    printf("b =        2   5     %%\n");

    // บรรทัดที่ 3: c =     1 . 9   0 0     %
    printf("c =      1 . 9   0 0     %%\n");

    // บรรทัดที่ 4: d = .     .         %
    printf("d =    .     .         %%\n");

    // บรรทัดที่ 5: e = 1 2 4 . 5 5     5   %
    printf("e = 1 2 4 . 5 5     5   %%\n");

    // บรรทัดที่ 6: f = 0       .     1   %  
    printf("f = 0       .     1   %%\n");

    return 0;
}
